; domain
(define (domain cooking)

    (:types ;
        movable location - object ; a manipulatable(movable) object
        workspace - location ; can be used for cutting
        container - movable ; something can be in a container
        veggie tool - movable ; objects that can be manipulated (pick/place/...)
        cuttool - tool ; tools that can cut
        gripper ; robotic gripper can hold objects
    )

    (:predicates ;
        ; General object predicates
        (is-sliced ?veg - veggie) ; True if veggie is sliced - observed predicate
        (available ?obj - movable) ; True is object is pickable - derived predicate
        (is-whole ?veg - veggie) ; True if veggie is intact - derived predicate

        ; Robot predicates
        (carry ?gripper - gripper ?obj - movable) ; - observed predicate
        (free ?gripper - gripper) ;  - derived predicate

        ; Location predicates
        (at ?obj - movable ?loc - location) ; True if ?obj is at ?loc - observed predicate
        (in ?obj - movable ?con - container) ; True if ?obj is in ?con - observed predicate
    )

    (:action pick
        :parameters (?bot - gripper ?obj - movable ?pick_loc - location)
        :precondition(
            and
            (available ?obj)
            (free ?bot)
            (at ?obj ?pick_loc)
        )
        :effect(
            and
            (not (available ?obj))
            (carry ?bot ?obj)
            (not (free ?bot))
            (not (at ?obj ?pick_loc))
        )
    )

    (:action place
        :parameters (?bot - gripper ?obj - movable ?place_loc - location)
        :precondition(
            and
            (carry ?bot ?obj)
            (not (free ?bot))
            (not (at ?obj ?place_loc))
        )
        :effect(
            and
            (available ?obj)
            (free ?bot)
            (at ?obj ?place_loc)
            (not (carry ?bot ?obj))
        )
    )

     (:action place_in
        :parameters (?bot - gripper ?obj - movable ?place_loc - container)
        :precondition(
            and
            (carry ?bot ?obj)
            (not (free ?bot))
            (not (in ?obj ?place_loc))
        )
        :effect(
            and
            (available ?obj)
            (free ?bot)
            (in ?obj ?place_loc)
            (not (carry ?bot ?obj))
        )
    )

    (:action slice
        :parameters (?bot - gripper ?veg - veggie ?cuttool - cuttool ?loc - workspace)
        :precondition(
            and
            (carry ?bot ?cuttool)
            (is-whole ?veg)
            (not (is-sliced ?veg))
            (at ?veg ?loc)
        )
        :effect(
            and
            (is-sliced ?veg)
            (not (is-whole ?veg))
        )
    )
  )

; problem
(define (problem cooking10)
(:domain cooking)
(:objects
    black_tray - location
    wooden_board - workspace
    bowl - container
    robotic_gripper - gripper
    robotic_gripper1 - gripper
    chopping_knife - cuttool
    tomato - veggie
    vegetable1 - veggie
    vegetable2 - veggie
)
(:init
    ( at bowl black_tray )
    ( at tomato black_tray )
    ( at vegetable2 wooden_board )
    ( available bowl )
    ( available tomato )
    ( carry robotic_gripper vegetable2 )
    ( carry robotic_gripper1 chopping_knife )
    ( carry robotic_gripper1 vegetable1 )
    ( carry robotic_gripper1 vegetable2 )
    ( is-whole tomato )
    ( is-whole vegetable1 )
    ( is-whole vegetable2 )
)

    (:goal
        (and
            (in tomato bowl)
            (is-sliced tomato)
        )
    )
)

; plan
1. (place_in robotic_gripper1 vegetable2 bowl)
   deleted: (carry robotic_gripper1 vegetable2)
   added: (available vegetable2) (free robotic_gripper1) (in vegetable2 bowl)
   goals met: 0 of 2
2. (pick robotic_gripper1 tomato black_tray)
   deleted: (available tomato) (free robotic_gripper1) (at tomato black_tray)
   added: (carry robotic_gripper1 tomato)
   goals met: 0 of 2
3. (place robotic_gripper1 tomato wooden_board)
   deleted: (carry robotic_gripper1 tomato)
   added: (available tomato) (free robotic_gripper1) (at tomato wooden_board)
   goals met: 0 of 2
4. (slice robotic_gripper1 tomato chopping_knife wooden_board)
   deleted: (is-whole tomato)
   added: (is-sliced tomato)
   goals met: 1 of 2
5. (pick robotic_gripper1 tomato wooden_board)
   deleted: (available tomato) (free robotic_gripper1) (at tomato wooden_board)
   added: (carry robotic_gripper1 tomato)
   goals met: 1 of 2
6. (place_in robotic_gripper1 tomato bowl)
   deleted: (carry robotic_gripper1 tomato)
   added: (available tomato) (free robotic_gripper1) (in tomato bowl)
   goals met: 2 of 2
